# PanelScheduleData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData Class
Members See Also
---
The PanelScheduleData class holds most of the data that describe the layout, appearance, and style of the rows, columns, and cells of a panel schedule
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PanelScheduleData : TableData
```

Visual Basic
---
```text
Public Class PanelScheduleData _
	Inherits TableData
```

Visual C++
---
```text
public ref class PanelScheduleData : public TableData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TableData Autodesk.Revit.DB.Electrical..::..PanelScheduleData
# See Also
PanelScheduleData Members
Autodesk.Revit.DB.Electrical Namespace